; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l12_p12_c12_g12_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(crate-at crate7 warehouse)
	(crate-at crate8 warehouse)
	(crate-at crate9 warehouse)
	(crate-at crate10 warehouse)
	(crate-at crate11 warehouse)
	(crate-at crate12 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(person-at person1 loc12)
	(person-at person2 loc1)
	(person-at person3 loc10)
	(person-at person4 loc11)
	(person-at person5 loc4)
	(person-at person6 loc4)
	(person-at person7 loc3)
	(person-at person8 loc9)
	(person-at person9 loc4)
	(person-at person10 loc6)
	(person-at person11 loc8)
	(person-at person12 loc4)
	(person-need person1 medicine)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 medicine)
	(person-need person8 food)
	(person-need person8 medicine)
	(person-need person9 medicine)
	(person-need person10 medicine)
	(person-need person11 medicine)
	(person-need person12 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 13
2. (pick-up-crate crate1 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 right crate1)
   goals met: 0 of 13
3. (pick-up-crate crate2 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 0 of 13
4. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 0 of 13
5. (drone-move loc12 loc9 drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 loc9)
   goals met: 0 of 13
6. (drop-crate loc9 person8 crate1 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate1)
   added: (has-content-person person8 food) (empty-arm drone1 right)
   goals met: 1 of 13
7. (drop-crate loc9 person8 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person8 medicine) (empty-arm drone1 left)
   goals met: 2 of 13
8. (drone-move loc9 warehouse drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 13
9. (pick-up-crate crate3 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 2 of 13
10. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 2 of 13
11. (drop-crate loc12 person1 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person1 medicine) (empty-arm drone1 right)
   goals met: 3 of 13
12. (drone-move loc12 warehouse drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 13
13. (pick-up-crate crate4 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 3 of 13
14. (drone-move warehouse loc10 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc10)
   goals met: 3 of 13
15. (drop-crate loc10 person3 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 4 of 13
16. (drone-move loc10 warehouse drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 13
17. (pick-up-crate crate5 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 4 of 13
18. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 4 of 13
19. (drop-crate loc11 person4 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 5 of 13
20. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 13
21. (pick-up-crate crate6 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 5 of 13
22. (drone-move warehouse loc3 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 5 of 13
23. (drop-crate loc3 person7 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 6 of 13
24. (drone-move loc3 warehouse drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 13
25. (pick-up-crate crate7 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate7 warehouse)
   added: (has-crate-drone-arm drone1 right crate7)
   goals met: 6 of 13
26. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 6 of 13
27. (drop-crate loc6 person10 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate7)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 7 of 13
28. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 13
29. (pick-up-crate crate8 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate8 warehouse)
   added: (has-crate-drone-arm drone1 right crate8)
   goals met: 7 of 13
30. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 7 of 13
31. (drop-crate loc8 person11 crate8 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate8)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 8 of 13
32. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 13
33. (pick-up-crate crate9 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate9 warehouse)
   added: (has-crate-drone-arm drone1 right crate9)
   goals met: 8 of 13
34. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 8 of 13
35. (drop-crate loc4 person5 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate9)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 9 of 13
36. (drone-move loc4 warehouse drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 13
37. (pick-up-crate crate10 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 warehouse)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 9 of 13
38. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 9 of 13
39. (drop-crate loc4 person6 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 10 of 13
40. (drone-move loc4 warehouse drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 13
41. (pick-up-crate crate11 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 warehouse)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 10 of 13
42. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 10 of 13
43. (drop-crate loc4 person9 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person9 medicine) (empty-arm drone1 right)
   goals met: 11 of 13
44. (drone-move loc4 warehouse drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 13
45. (pick-up-crate crate12 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 warehouse)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 11 of 13
46. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 11 of 13
47. (drop-crate loc4 person12 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person12 medicine) (empty-arm drone1 right)
   goals met: 12 of 13
48. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 13 of 13
